#include <stdio.h>
#include <math.h>

int main() {
    int d, d1, d2, d3, d4, d5, reversed;

    printf("Введіть п’ятизначне число: ");
    scanf("%d", &d);

    // Розбиваємо число на окремі цифри
    d5 = d % 10;        // Отримуємо останню цифру
    d4 = ((d % 100) - d5) / 10;    // Отримуємо передостанню цифру
    d3 = ((d % 1000) - (d % 100)) / 100;  // Отримуємо середню цифру
    d2 = ((d % 10000) - (d % 1000)) / 1000; // Отримуємо другу цифру
    d1 = (d - (d % 10000)) / 10000;   // Отримуємо першу цифру

    // Збираємо розвернуте число
    reversed = d5 * 10000 + d4 * 1000 + d3 * 100 + d2 * 10 + d1;

    printf("d1 = %d\n", reversed);

    return 0;
}
